brew "bash"
brew "bat"
brew "composer"
brew "curl"
brew "dust"
brew "exa"
brew "fd"
brew "gh"
brew "git"
brew "git-delta"
brew "httpie"
brew "jq"
brew "make"
brew "mkcert"
brew "mysql"
brew "nano"
brew "php"
brew "tealdeer"
brew "tig"
brew "tokei"
brew "tree"
brew "ungit"
brew "unzip"
brew "volta"
brew "wget"
brew "zsh"
brew "zsh-completions"
